## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 21 to add, 9 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                RESOURCE                                 |
|----------|-------------------------------------------------------------------------|
| add      | `aws_iam_access_key.superset_send_email`                                |
|          | `aws_iam_group.superset_send_email`                                     |
|          | `aws_iam_group_membership.superset_send_email`                          |
|          | `aws_iam_group_policy_attachment.superset_send_email`                   |
|          | `aws_iam_policy.superset_send_email`                                    |
|          | `aws_iam_user.superset_send_email`                                      |
|          | `aws_route53_record.superset_dkim_CNAME[0]`                             |
|          | `aws_route53_record.superset_dkim_CNAME[1]`                             |
|          | `aws_route53_record.superset_dkim_CNAME[2]`                             |
|          | `aws_route53_record.superset_dmarc_TXT`                                 |
|          | `aws_route53_record.superset_ses_verification_TXT`                      |
|          | `aws_route53_record.superset_spf_TXT`                                   |
|          | `aws_security_group_rule.superset_ecs_ingress_self`                     |
|          | `aws_ses_domain_dkim.superset`                                          |
|          | `aws_ses_domain_identity.superset`                                      |
|          | `aws_ses_domain_identity_verification.superset`                         |
|          | `aws_ssm_parameter.slack_api_token`                                     |
| update   | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-beat&quot;]`   |
|          | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-worker&quot;]` |
|          | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;superset&quot;]`      |
|          | `module.celery_beat_ecs.aws_ecs_service.this`                           |
|          | `module.celery_beat_ecs.aws_iam_policy.this_task_exec`                  |
|          | `module.celery_worker_ecs.aws_ecs_service.this`                         |
|          | `module.celery_worker_ecs.aws_iam_policy.this_task_exec`                |
|          | `module.superset_ecs.aws_ecs_service.this`                              |
|          | `module.superset_ecs.aws_iam_policy.this_task_exec`                     |
| recreate | `aws_ecs_task_definition.superset_upgrade`                              |
|          | `module.celery_beat_ecs.aws_ecs_task_definition.this`                   |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this`                 |
|          | `module.superset_ecs.aws_ecs_task_definition.this`                      |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-superset/actions/runs/16756215397).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # data.aws_iam_policy_document.superset_send_email will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "superset_send_email" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendRawEmail",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-beat"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id                        = "celery-beat-error"
        name                      = "celery-beat-error"
      ~ pattern                   = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*flask_appbuilder.api:dict is not a sequence*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*TYPE_MISMATCH*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error handling request /api/v1/*/thumbnail/*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*flask_appbuilder.api:dict is not a sequence*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*Timed out requesting url http://superset.superset.ecs.local**\" && w1!=\"*TYPE_MISMATCH*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-worker"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id                        = "celery-worker-error"
        name                      = "celery-worker-error"
      ~ pattern                   = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*flask_appbuilder.api:dict is not a sequence*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*TYPE_MISMATCH*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error handling request /api/v1/*/thumbnail/*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*flask_appbuilder.api:dict is not a sequence*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*Timed out requesting url http://superset.superset.ecs.local**\" && w1!=\"*TYPE_MISMATCH*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["superset"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id                        = "superset-error"
        name                      = "superset-error"
      ~ pattern                   = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*flask_appbuilder.api:dict is not a sequence*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*TYPE_MISMATCH*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error handling request /api/v1/*/thumbnail/*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*flask_appbuilder.api:dict is not a sequence*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*Timed out requesting url http://superset.superset.ecs.local**\" && w1!=\"*TYPE_MISMATCH*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.superset_upgrade must be replaced
-/+ resource "aws_ecs_task_definition" "superset_upgrade" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade:40" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command          = [
                      - "/app/docker/docker-bootstrap.sh",
                      - "upgrade",
                    ]
                  - cpu              = 1024
                  - environment      = [
                      - {
                          - name  = "GUNICORN_KEEPALIVE"
                          - value = "120"
                        },
                      - {
                          - name  = "REDIS_HOST"
                          - value = "superset-cache-prod.m4q4yy.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_PORT"
                          - value = "6379"
                        },
                      - {
                          - name  = "SUPERSET_DATABASE_DB"
                          - value = "superset"
                        },
                      - {
                          - name  = "THUMBNAIL_SELENIUM_USER"
                          - value = "cache-warmer"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL"
                          - value = "https://superset.cds-snc.ca"
                        },
                    ]
                  - essential        = true
                  - image            = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - add  = []
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/superset/superset"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "upgrade"
                        }
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "superset-upgrade"
                  - portMappings     = [
                      - {
                          - containerPort = 8088
                          - hostPort      = 8088
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SUPERSET_DATABASE_HOST"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_USER"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      - {
                          - name      = "SUPERSET_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "superset-upgrade" -> (known after apply)
      ~ revision                 = 40 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_access_key.superset_send_email will be created
  + resource "aws_iam_access_key" "superset_send_email" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "superset_send_email"
    }

  # aws_iam_group.superset_send_email will be created
  + resource "aws_iam_group" "superset_send_email" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "superset_send_email"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.superset_send_email will be created
  + resource "aws_iam_group_membership" "superset_send_email" {
      + group = "superset_send_email"
      + id    = (known after apply)
      + name  = "superset_send_email"
      + users = [
          + "superset_send_email",
        ]
    }

  # aws_iam_group_policy_attachment.superset_send_email will be created
  + resource "aws_iam_group_policy_attachment" "superset_send_email" {
      + group      = "superset_send_email"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.superset_send_email will be created
  + resource "aws_iam_policy" "superset_send_email" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "superset_send_email"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user.superset_send_email will be created
  + resource "aws_iam_user" "superset_send_email" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "superset_send_email"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_route53_record.superset_dkim_CNAME[0] will be created
  + resource "aws_route53_record" "superset_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z01732642VUBMM3R05P6L"
    }

  # aws_route53_record.superset_dkim_CNAME[1] will be created
  + resource "aws_route53_record" "superset_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z01732642VUBMM3R05P6L"
    }

  # aws_route53_record.superset_dkim_CNAME[2] will be created
  + resource "aws_route53_record" "superset_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z01732642VUBMM3R05P6L"
    }

  # aws_route53_record.superset_dmarc_TXT will be created
  + resource "aws_route53_record" "superset_dmarc_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.superset.cds-snc.ca"
      + records         = [
          + "v=DMARC1; p=reject; sp=reject; pct=100; rua=mailto:CDS.SECURITY-SECURITE.SNC@servicecanada.gc.ca",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z01732642VUBMM3R05P6L"
    }

  # aws_route53_record.superset_ses_verification_TXT will be created
  + resource "aws_route53_record" "superset_ses_verification_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z01732642VUBMM3R05P6L"
    }

  # aws_route53_record.superset_spf_TXT will be created
  + resource "aws_route53_record" "superset_spf_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "superset.cds-snc.ca"
      + records         = [
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z01732642VUBMM3R05P6L"
    }

  # aws_security_group_rule.superset_ecs_ingress_self will be created
  + resource "aws_security_group_rule" "superset_ecs_ingress_self" {
      + description              = "Ingress from Superset ECS task to itself"
      + from_port                = 8088
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ca-central-1"
      + security_group_id        = "sg-038e16631d49d3f69"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 8088
      + type                     = "ingress"
    }

  # aws_ses_domain_dkim.superset will be created
  + resource "aws_ses_domain_dkim" "superset" {
      + dkim_tokens = (known after apply)
      + domain      = "superset.cds-snc.ca"
      + id          = (known after apply)
      + region      = "ca-central-1"
    }

  # aws_ses_domain_identity.superset will be created
  + resource "aws_ses_domain_identity" "superset" {
      + arn                = (known after apply)
      + domain             = "superset.cds-snc.ca"
      + id                 = (known after apply)
      + region             = "ca-central-1"
      + verification_token = (known after apply)
    }

  # aws_ses_domain_identity_verification.superset will be created
  + resource "aws_ses_domain_identity_verification" "superset" {
      + arn    = (known after apply)
      + domain = (known after apply)
      + id     = (known after apply)
      + region = "ca-central-1"
    }

  # aws_ssm_parameter.slack_api_token will be created
  + resource "aws_ssm_parameter" "slack_api_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "slack_api_token"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.celery_beat_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-beat"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_beat_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-beat:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-beat:145" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:129" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "/app/docker/docker-bootstrap.sh",
                      - "beat",
                    ]
                  - environment            = [
                      - {
                          - name  = "GUNICORN_KEEPALIVE"
                          - value = "120"
                        },
                      - {
                          - name  = "REDIS_HOST"
                          - value = "superset-cache-prod.m4q4yy.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_PORT"
                          - value = "6379"
                        },
                      - {
                          - name  = "SUPERSET_DATABASE_DB"
                          - value = "superset"
                        },
                      - {
                          - name  = "THUMBNAIL_SELENIUM_USER"
                          - value = "cache-warmer"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL"
                          - value = "https://superset.cds-snc.ca"
                        },
                    ]
                  - essential              = true
                  - image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  - linuxParameters        = {
                      - capabilities = {
                          - add  = []
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/superset/celery-beat"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "celery-beat"
                  - portMappings           = [
                      - {
                          - containerPort = 8088
                          - hostPort      = 8088
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "SUPERSET_DATABASE_HOST"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_USER"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      - {
                          - name      = "SUPERSET_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 129 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.celery_beat_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::066023111852:policy/celery-beat_ecs_task_exec_policy"
        name             = "celery-beat_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          -...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
